ThaoVy1607/MSP430_Ultrasonic_SIM7670C/examples/USS_Water_Demo/USSLibGUIApp/fr6047_USS_app/testingDC/testing.c
#ifdef USS_APP_ADDTL_TX_SEQUENCE_ENABLE
/*! Supported Pre-defined additional TX sequences */
const USS_App_AddlTXSequence_t  addtlTXSeqs[USS_APP_ADDTL_TX_SEQUENCES_MAX] =
{
     // Sequence #1
     // 2 trill pulses
     // X-pulse #1 = 1 @300kHz (with 80Mhz PLL)
     // E-pulse #1 = 1 @400kHz (with 80Mhz PLL)
     // X-pulse #2 = 2 @500kHz (with 80Mhz PLL)
     // E-pulse #2 = 3 @800kHz (with 80Mhz PLL)
     {
         .numTrillCycles = 2,
         .xpulse = { 1, 2 },
         .xhper = { 133, 80 },  // 80Mhz / (133+133) = ~300kHz
         .xlper = { 133, 80 },  // 80Mhz / (80+80) = 500kHz
         .epulse = { 1, 3 },
         .ehper = { 100, 50 },  // 80Mhz / (100+100) = 400kHz
         .elper = { 100, 50 },  // 80Mhz / (50+50) = 800kHz
         .binPatternLen = 25,   // 25 counts of binary pattern at 8Mhz
         .binPattern =
         { 1,1,1,-1,-1,-1,1,1,1,-1,-1,1,1,-1,-1,1,1,-1,-1,1,-1,1,-1,1,-1},
     }
};

#endif

void Testing_PreMeasurement_Update(void)
{
#ifdef TEST_TRIM_CONST
    // Use a specific TRIM Setting
    // Unlock the TRIM Setting Registers
    SAPHKEY = KEY;
    SAPHTACTL |= UNLOCK;
    // Initialize with default 0xFEEFEE configuration
    SAPHCH0PUT = 0x0F;    SAPHCH0PDT = 0x0E;    SAPHCH0TT  = 0x0E;
    SAPHCH1PUT = 0x0F;    SAPHCH1PDT = 0x0E;    SAPHCH1TT  = 0x0E;
    // Lock the TRIM Setting Registers
    SAPHTACTL &= ~UNLOCK;
    SAPHKEY = 0x00;
#endif

}

void Testing_PostMeasurement_Update(void)
{

#ifdef TEST_ADC_MAX_AMPLITUDE
	{
		uint16_t i;
		int16_t maxDNSUPSVal, minDNSUPSVal;
		int16_t* tempUPSPtr = USS_getUPSPtr(&gUssSWConfig);
		int16_t* tempDNSPtr = USS_getDNSPtr(&gUssSWConfig);
		maxDNSUPSVal = MIN_ADC_VALUE; minDNSUPSVal = MAX_ADC_VALUE;
		for (i=0; i < gUssSWConfig.captureConfig->sampleSize; i++)
		{
			// MAX Comparison for DNS & UPS
			if (maxDNSUPSVal < tempUPSPtr[i])
				maxDNSUPSVal = tempUPSPtr[i];
			if (maxDNSUPSVal < tempUPSPtr[i])
				maxDNSUPSVal = tempUPSPtr[i];
			// MIN Comparison for DNS & UPS
			if (minDNSUPSVal > tempDNSPtr[i])
				minDNSUPSVal = tempDNSPtr[i];
			if (minDNSUPSVal > tempDNSPtr[i])
				minDNSUPSVal = tempDNSPtr[i];
		}
		if (maxDNSUPSVal < abs(minDNSUPSVal))
			maxDNSUPSVal = abs(minDNSUPSVal);

		i16max_amplitude = maxDNSUPSVal;
	}
#endif
}

void Testing_PostAlgorithm_Update(void)
{
}

void Testing_GUIUpdate_PreUSSConfig(void)
{
	COMAND_HANDLER *DC_User_Params = CommandHandler_getUserParamsPtr();

}

void Testing_GUIUpdate_PostUSSConfig(void)
{
	COMAND_HANDLER *DC_User_Params = CommandHandler_getUserParamsPtr();

}

bool Testing_Update_Results(USS_Algorithms_Results *results, float *debugData)
{
#ifdef USS_APP_RESONATOR_CALIBRATE_ENABLE
        // For testing purposes, the Clock Correction Calibration Value is stored in
        // the results structure
        *debugData = _IQ27toF(gUssSWConfig.algorithmsConfig->clockRelativeError);
        // Return true to display Clock Correction
        return true;
#else
#ifdef TEST_ADC_MAX_AMPLITUDE
        // For testing purposes, the Max amplitude of the signal is stored in
        // the results structure
        *debugData = (float) i16max_amplitude;
        // Return true to display amplitude
        return true;
#else
        // Do not send debug info to GUI
        *debugData = 0;
        return false;
#endif  // TEST_ADC_MAX_AMPLITUDE
#endif  // USS_APP_RESONATOR_CALIBRATE_ENABLE
        
}

